tutorials/multiphase/interDyMFoam/ras/floatingObject/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    stationaryWalls
    {
        type            wall;
        nFaces          11200;
        startFace       281600;
    }
    atmosphere
    {
        type            patch;
        nFaces          1600;
        startFace       292800;
    }
    floatingObject
    {
        type            wall;
        nFaces          0;
        startFace       294400;
    }
)

// ************************************************************************* //
